{
  "trainerName": "Sam",
  "clientName": "Caroline",
  "programName": "Equestrian Athlete • Full 12-Week Roadmap",
  "program": [
    {
      "id": "daily_routine",
      "title": "Daily Routine: Warm-Up & Recovery",
      "sub": "Pre-Ride & Post-Ride",
      "color": "bg-emerald-600",
      "gradient": "from-emerald-600 to-teal-500",
      "icon": "functional",
      "exercises": [
        { "id": "pre_1", "name": "Leg Swings (Front/Back & Side)", "video": "https://youtube.com/shorts/WNfUHaR-3hE?si=N80FpX3snOG4XLzt", "isProgrammed": true, "note": "• Anchor yourself: Hold onto a wall or fence post. This is a mobility drill, not a balance test.\n• Don't arch: Keep your core slightly braced. When swinging the leg back, avoid arching your lower back to get extra height. The movement should come from the hip, not the spine.\n• Soft Knee: Keep a slight bend in the leg you are standing on to prevent locking the joint.", "sets": [{ "id": 1, "reps": 10, "completed": false }] },
        { "id": "pre_2", "name": "Hip Circles (Standing Hip CARs)", "video": "https://www.youtube.com/watch?v=hRMrq6G81p8", "isProgrammed": true, "note": "• Isolate the Joint: Imagine your upper body is a statue. Only the hip should move. If you have to lean your torso to get your leg higher, lower the leg.\n• The \"Hurdle\": Visualize stepping up and over a high hurdle. Pattern: Knee to chest → open knee to side → rotate foot up behind you → knees together.\n• Slow Down: Unlike leg swings, this should be slow and controlled (CARs = Controlled Articular Rotations).", "sets": [{ "id": 2, "reps": 5, "completed": false }] },
        { "id": "pre_3", "name": "Walking Lunges + Twist", "video": "https://youtube.com/shorts/2crIg2iqi8w?si=LSCsVh8ap8HmG2mp", "isProgrammed": true, "note": "• Twist Toward the Knee: Always twist your torso toward the front leg. This locks the hips and forces the rotation to come from your thoracic spine (upper back), which is crucial for turning in the saddle without shifting your seat.\n• Vertical Shin: When you land, your front shin should be roughly vertical. Don't let the knee cave inward.\n• Hips Square: Keep your hip bones pointing straight ahead like headlights; only the shoulders rotate.", "sets": [{ "id": 3, "reps": 8, "completed": false }] },
        { "id": "pre_4", "name": "Lateral Lunges", "video": "https://www.youtube.com/watch?v=4NlJdSzHeUg", "isProgrammed": true, "note": "• Sit Back: Initiate the movement by pushing your hips back (like sitting in a chair), not just bending the knee.\n• Keep heels down: Ensure the heel of the bending leg stays glued to the ground. If it lifts, widen your stance or don't go as deep.\n• Trailing Leg: The non-working leg must remain perfectly straight. You should feel a stretch in the inner thigh of that straight leg.", "sets": [{ "id": 4, "reps": 10, "completed": false }] },
        { "id": "pre_5", "name": "Open/Close the Gate", "video": "https://youtube.com/shorts/1cpY_x7yr8c?si=uRtvJdddibbP40Ry", "isProgrammed": true, "note": "• Mounting Motion: This mimics the motion of swinging your leg over the horse.\n• Open: Lift knee to hip height, rotate it out to the side, and step down.\n• Close: Lift knee out to the side, rotate it to the front, and step down.\n• No Wiggle: Keep your belt buckle facing forward. Don't let your hips rotate with the leg.", "sets": [{ "id": 5, "reps": 10, "completed": false }] },
        { "id": "pre_6", "name": "Arm Circles & Trunk Rotations", "video": "https://youtube.com/shorts/o4w8ZKwfuVE?si=Yz5C5ic5Ptfm53Ds", "isProgrammed": true, "note": "• Arm Circles: Start small and get progressively larger. Focus on reaching out to the sides to expand the chest, not just spinning the arms.\n• Trunk Rotations: Plant your feet wider than shoulder-width. Rotate your upper body while keeping your hips completely still. This \"dissociation\" (moving shoulders independently of hips) is vital for giving independent aids.", "sets": [{ "id": 6, "reps": 10, "completed": false }] },
        { "id": "post_1", "name": "COOL: Hip Flexor Stretch", "video": "https://www.youtube.com/watch?v=mzPvzMivukw", "isProgrammed": true, "note": "• The \"Anti-Arch\": Kneel on one knee. The most common mistake is leaning forward too far and arching the back. Instead, stay upright and tuck your pelvis under (posterior tilt).\n• Glute Activation: Squeeze the glute of the kneeling leg hard. You should feel a deep stretch in the front of the hip without moving forward much at all.", "sets": [{ "id": 11, "weight": 30, "reps": 1, "completed": false }] },
        { "id": "post_2", "name": "COOL: Adductor Stretch", "video": "https://youtu.be/Q4QEtbRbPzU?si=UdWvBwlfEhcUDVPl", "isProgrammed": true, "note": "• Stance: Take a very wide stance (wider than your shoulders). Shift your weight to one side, bending that knee while keeping the other leg completely straight.\n• Torso Lean: It is okay to lean forward slightly, but keep your back flat.\n• Hold: Since this is a cool-down, hold statically for 30+ seconds. Relax into the stretch to release the tension from gripping the saddle.", "sets": [{ "id": 12, "weight": 30, "reps": 1, "completed": false }] },
        { "id": "post_3", "name": "COOL: Figure-4 Glute Stretch", "video": "https://www.youtube.com/watch?v=2VE_NLcNMvQ", "isProgrammed": true, "note": "• Lying Down: Lie on your back. Cross your right ankle over your left knee.\n• Pull In: Grab behind your left thigh and gently pull it toward your chest.\n• Relax: Keep your head and shoulders on the ground. If you have to lift your head to grab your leg, use a towel or strap to bridge the gap so your neck stays relaxed.", "sets": [{ "id": 13, "weight": 30, "reps": 1, "completed": false }] },
        { "id": "post_4", "name": "COOL: Calf Stretch", "video": "https://youtu.be/mafo7o7OnFo?si=VhMjvjMtL2HqtLvp", "isProgrammed": true, "note": "• Wall Push: Place hands on a wall. Step one foot back.\n• Lock the Heel: The goal is to keep the back heel touching the ground. If it lifts, step in slightly.\n• Two Angles: Do 15 seconds with a straight back leg (Gastrocnemius) and 15 seconds with a slightly bent back leg (Soleus) to hit both calf muscles.", "sets": [{ "id": 14, "weight": 30, "reps": 1, "completed": false }] },
        { "id": "post_5", "name": "COOL: Chest Opener", "video": "https://youtube.com/shorts/PWGuI3rTRx0?si=KbMUVRvrx7R0ZOQq", "isProgrammed": true, "note": "• Doorway: Place your forearm against a doorframe at a 90-degree angle (elbow at shoulder height).\n• Step: Gently step one foot through the doorway until you feel a stretch across the front of the chest and shoulder.\n• Don't Rotate: Keep your chest square to the front; don't just twist your body away from the arm.", "sets": [{ "id": 15, "weight": 30, "reps": 1, "completed": false }] },
        { "id": "post_6", "name": "COOL: Cat-Cow Release", "video": "https://youtu.be/LIVJZZyZ2qM?si=VZN0yUFs4teoKR08", "isProgrammed": true, "note": "• Motion Wave: Don't just flop up and down. Try to move one vertebra at a time, starting from the tailbone and finishing with the head.\n• Cat (Round): Push the ground away with your hands, tuck your chin, and tuck your tailbone. Spread your shoulder blades apart.\n• Cow (Arch): Lift your tailbone, drop your belly, and look up slightly. Squeeze your shoulder blades together.", "sets": [{ "id": 16, "reps": 5, "completed": false }] }
      ]
    },
    {
      "id": "p1_a",
      "title": "Phase 1: Workout A (Weeks 1-4)",
      "sub": "Foundation & Mobility",
      "color": "bg-orange-500",
      "gradient": "from-orange-500 to-red-400",
      "icon": "legs",
      "exercises": [
        { "id": "p1a_1", "name": "Goblet Squat", "video": "https://youtube.com/shorts/lRYBbchqxtI?si=gXw-pLGISqrgiGAX", "isProgrammed": true, "note": "• The Hold: Cup the top head of the dumbbell (or handle of the kettlebell) right against your sternum. This counter-weight forces your core to engage and keeps your torso upright—mimicking good dressage posture.\n• Depth Check: Aim to get your elbows to touch the insides of your knees. This ensures you are hitting full depth without rounding your lower back.\n• Foot Pressure: Keep weight evenly distributed between your big toe, little toe, and heel (the \"tripod\"). Don't let the heels lift.", "sets": [{ "id": 101, "weight": 0, "reps": 12, "completed": false }, { "id": 102, "weight": 0, "reps": 12, "completed": false }, { "id": 103, "weight": 0, "reps": 12, "completed": false }] },
        { "id": "p1a_2", "name": "Romanian Deadlift (RDL)", "video": "https://youtube.com/shorts/vnEANU7BqqY?si=-HuZCWPYBOQRjpw9", "isProgrammed": true, "note": "• The Hinge: Imagine your hands are full of groceries and you need to close a car door behind you with your butt. Push the hips back horizontally.\n• Knee Position: Unlock your knees slightly at the start, then freeze them. They shouldn't bend further as you lower the weight. If they bend, it becomes a squat.\n• Lat Engagement: Squeeze your armpits tight (like you're holding a riding crop under your arm). This keeps the weight close to your legs and protects the lower back.", "sets": [{ "id": 104, "weight": 0, "reps": 10, "completed": false }, { "id": 105, "weight": 0, "reps": 10, "completed": false }, { "id": 106, "weight": 0, "reps": 10, "completed": false }] },
        { "id": "p1a_3", "name": "Lateral Lunge", "video": "https://www.youtube.com/watch?v=4NlJdSzHeUg", "isProgrammed": true, "note": "• Hips Back: Step out, and immediately push your hips back as if aiming for a chair behind your heel.\n• The Anchor: The non-working leg must remain perfectly straight with the foot flat. You should feel a stretch in the inner thigh (adductor) of the straight leg.\n• Torso: \"Show the logo on your shirt.\" Keep your chest up to prevent collapsing forward, which compromises balance.", "sets": [{ "id": 107, "weight": 0, "reps": 8, "completed": false }, { "id": 108, "weight": 0, "reps": 8, "completed": false }] },
        { "id": "p1a_4", "name": "Copenhagen Plank (Bent-Knee)", "video": "https://www.youtube.com/shorts/5paDavNMjGM", "isProgrammed": true, "note": "• Setup: Place the knee of your top leg on a bench or chair (this is the regression from the full ankle version). The bottom leg can be bent or straight, but it must be off the ground.\n• Adductor Focus: This directly targets the inner thigh muscles used to grip the saddle. Focus on driving the top knee down into the bench to lift the rest of the body.\n• Straight Line: Ensure a straight line from shoulder to knee. Don't let the hips sag toward the floor.", "sets": [{ "id": 109, "weight": 15, "reps": 1, "completed": false }, { "id": 110, "weight": 15, "reps": 1, "completed": false }] },
        { "id": "p1a_5", "name": "Back Extension (Supermans)", "video": "https://youtube.com/shorts/807123456789?si=KJHGFDSDFGHJKL", "isProgrammed": true, "note": "• Reach: Think about reaching your fingertips to one wall and your toes to the other. Length creates tension; height creates compression (which we want to avoid).\n• Glute Squeeze: Squeeze your glutes before you lift. If you feel this mostly in your lower back, you aren't using your glutes enough.\n• Neck Alignment: Keep your gaze on the floor. Looking up cranks the neck and breaks the spinal alignment.", "sets": [{ "id": 111, "weight": 0, "reps": 15, "completed": false }, { "id": 112, "weight": 0, "reps": 15, "completed": false }] },
        { "id": "p1a_6", "name": "Bird-Dog", "video": "https://youtube.com/shorts/wiFNA3sqjCA?si=KJHGFDSDFGHJKL", "isProgrammed": true, "note": "• The Tray: Imagine a tray of expensive drinks resting on your lower back. As you move your arm and leg, the tray shouldn't tip.\n• Opposites: Extend your right arm and left leg simultaneously. Pause at full extension.\n• Rider Relevance: This trains diagonal stability (like the trot). If you wobble here, you likely wobble in the saddle during transitions.", "sets": [{ "id": 113, "weight": 0, "reps": 10, "completed": false }, { "id": 114, "weight": 0, "reps": 10, "completed": false }] },
        { "id": "p1a_7", "name": "Dumbbell One-arm Row", "video": "https://youtube.com/shorts/rO4Q7nW0ygo?si=8IVtvGaGn1oBKP74", "isProgrammed": true, "note": "• Pull Angle: Don't pull the weight straight up to your chest. Pull the dumbbell back toward your hip pocket. This engages the lats (back) rather than the upper traps (neck).\n• Anti-Rotation: As you lower the weight, fight the urge to let your shoulder drop toward the floor. Keep your shoulders square to the ground the entire time.\n• Support: Press the non-working hand firmly into the bench to create a stable base.", "sets": [{ "id": 115, "weight": 0, "reps": 10, "completed": false }, { "id": 116, "weight": 0, "reps": 10, "completed": false }] },
        { "id": "p1a_8", "name": "Incline Push-ups", "video": "https://youtube.com/shorts/7f8JOu0i1cQ?si=GyaVHVsTE8mgnX9M", "isProgrammed": true, "note": "• Body Line: Your body should be a rigid plank from head to heel. If your hips sag, the core isn't working.\n• Elbow Angle: Don't flare your elbows out to the sides (making a \"T\" shape). Tuck them back at a 45-degree angle (making an \"Arrow\" shape). This is safer for the shoulders.\n• Incline: Use a bench, box, or even a wall. The higher the surface, the easier the movement. Prioritize perfect form over getting closer to the floor.", "sets": [{ "id": 117, "weight": 0, "reps": 12, "completed": false }, { "id": 118, "weight": 0, "reps": 12, "completed": false }] },
        { "id": "p1a_9", "name": "90/90 Hip Stretch & Activation", "video": "https://youtu.be/t4Zz6-aG8Iw?si=tCo2RE3Aj1_5EivF", "isProgrammed": true, "note": "• Setup: Sit on the floor. Front leg bent at 90 degrees in front of you, back leg bent at 90 degrees to the side.\n• Stretch (Passive): Lean your torso forward over the front shin while keeping a flat back. Do not round your spine to get lower.\n• Activation (Active): After stretching, drive both knees and shins hard into the floor for 5-10 seconds. This builds strength at the end range of motion.", "sets": [{ "id": 119, "reps": 5, "completed": false }] },
        { "id": "p1a_10", "name": "Ankle Dorsiflexion Rocks", "video": "https://youtube.com/shorts/OmJ6vNfZwYQ?si=SXJUpusB71S9vniK", "isProgrammed": true, "note": "• The Goal: Increase the range of motion for the \"heels down\" riding position without forcing it.\n• Setup: Start in a half-kneeling position or standing facing a wall.\n• The Rock: Push your front knee forward over your toes as far as you can without letting the heel pop up off the ground.\n• Alignment: Ensure the knee tracks toward the middle or outside toes, not collapsing inward.", "sets": [{ "id": 120, "reps": 10, "completed": false }] }
      ]
    },
    {
      "id": "p1_b",
      "title": "Phase 1: Workout B (Weeks 1-4)",
      "sub": "Support & Unilateral Strength",
      "color": "bg-orange-400",
      "gradient": "from-orange-400 to-amber-500",
      "icon": "legs",
      "exercises": [
        { "id": "p1b_1", "name": "Trap Bar / KB Deadlift", "video": "https://youtube.com/shorts/v-SrIcAp3vM?si=Kdh3EYUusEfBm1o0", "isProgrammed": true, "note": "• The Setup: Unlike the RDL (which starts from the top), this starts from the floor. If you don't have a trap bar, place a heavy Kettlebell between your feet.\n• Squat vs. Hinge: This is a hybrid movement. Your hips will be lower than in an RDL, and your chest will be more upright. Think of it as \"squatting the weight up\" rather than just pulling with your back.\n• Shin Angle: Your shins can travel forward slightly (unlike the vertical shins of the RDL).\n• Lat Tension: Before you lift, rotate your elbows back to engage your lats. This protects your spine from rounding under the load.", "sets": [{ "id": 131, "weight": 0, "reps": 8, "completed": false }, { "id": 132, "weight": 0, "reps": 8, "completed": false }, { "id": 133, "weight": 0, "reps": 8, "completed": false }] },
        { "id": "p1b_2", "name": "Reverse Lunge", "video": "https://youtube.com/shorts/J9MpoAQCjos?si=J_7mlNhCpMWSKc-W", "isProgrammed": true, "note": "• Stance Width: Step back on \"railroad tracks\" (feet hip-width apart). If you step directly behind the front foot (like a tightrope), you will lose balance.\n• Weight Distribution: Keep about 70% of your weight in the front heel. The back leg is mostly a kickstand for balance.\n• Torso Lean: A slight forward lean of the torso is perfect—it mimics the \"two-point\" or jumping position and engages the glute of the front leg more effectively.", "sets": [{ "id": 134, "weight": 0, "reps": 8, "completed": false }, { "id": 135, "weight": 0, "reps": 8, "completed": false }] },
        { "id": "p1b_3", "name": "Copenhagen Plank (Hold)", "video": "https://www.youtube.com/shorts/5paDavNMjGM", "isProgrammed": true, "note": "• The Progression: In Workout A, you used a bent knee. For this workout, aim to place your ankle/foot on the bench with a straight leg. If that is too hard, go back to the knee.\n• Static Hold: This is an isometric hold. You are training the adductors (inner thigh) to stabilize the pelvis without movement—exactly what they do when you are riding a circle or lateral work.\n• No Sagging: If your hips start to dip toward the floor, the set is over. Quality over duration.", "sets": [{ "id": 136, "weight": 15, "reps": 1, "completed": false }] },
        { "id": "p1b_4", "name": "Swiss Ball Hamstring Curls", "video": "https://youtu.be/XkESHgkTdFw?si=beq5hR3fQhpzpieD", "isProgrammed": true, "note": "• Bridge First: Lie on your back with heels on the ball. Lift your hips into a bridge before you start curling.\n• The Curl: Drag the ball toward your glutes with your heels while keeping your hips lifted. The goal is to keep a straight line from shoulder to knee at the top of the curl.\n• Instability: The ball will try to wobble side-to-side. Fighting that wobble activates the small stabilizer muscles in your hips and core.", "sets": [{ "id": 137, "weight": 0, "reps": 12, "completed": false }, { "id": 138, "weight": 0, "reps": 12, "completed": false }] },
        { "id": "p1b_5", "name": "Plank with Shoulder Taps", "video": "https://youtube.com/shorts/gccQ1hMX46U?si=H0AQjVTIrw9wavd8", "isProgrammed": true, "note": "• The Goal: The goal isn't to tap your shoulder; the goal is to not move your hips while you do it. Imagine there is a glass of water balancing on your lower back.\n• Foot Position: Widen your feet! A wider base makes it easier to keep the hips square. As you get stronger, bring the feet closer together.\n• Anti-Rotation: This trains your core to resist twisting forces—vital for staying centered when a horse spooks or turns sharply.", "sets": [{ "id": 139, "weight": 0, "reps": 10, "completed": false }, { "id": 140, "weight": 0, "reps": 10, "completed": false }] },
        { "id": "p1b_6", "name": "Face Pulls", "video": "https://youtube.com/shorts/vQCi5Xzhoyw?si=Y8KWiHo7NYlpyBTd", "isProgrammed": true, "note": "• Grip: Hold the rope attachment with palms facing each other (neutral grip).\n• The Pull: Pull the center of the rope toward the bridge of your nose. As you pull, drive your hands back and your elbows out.\n• End Position: At the end of the movement, your arms should look like a \"double bicep\" pose. Your hands should be further back than your elbows (external rotation).\n• Posture Fix: This is the ultimate antidote to \"rounded rider shoulders.\" Squeeze your shoulder blades together hard at the peak.", "sets": [{ "id": 141, "weight": 0, "reps": 15, "completed": false }, { "id": 142, "weight": 0, "reps": 15, "completed": false }] }
      ]
    },
    {
      "id": "p2_a",
      "title": "Phase 2: Workout A (Weeks 5-8)",
      "sub": "Strength Build & Explosion",
      "color": "bg-blue-600",
      "gradient": "from-blue-600 to-indigo-500",
      "icon": "push",
      "exercises": [
        { "id": "p2a_1", "name": "Back Squat", "video": "https://www.youtube.com/watch?v=T_t85kQEDWk", "isProgrammed": true, "note": "• Create the Shelf: Rest the bar on your upper traps (the meaty part), not your neck. Pull your elbows down and back to create a tight \"shelf\" for the bar.\n• The Descent: Unlock your hips and knees at the same time. As you go down, imagine spreading the floor apart with your feet to engage your glutes.\n• Rider Relevance: This mimics the absorption of a heavy landing. Maintain a neutral spine (no rounding) just like you would in the saddle.", "sets": [{ "id": 201, "weight": 0, "reps": 8, "completed": false }, { "id": 202, "weight": 0, "reps": 8, "completed": false }, { "id": 203, "weight": 0, "reps": 8, "completed": false }] },
        { "id": "p2a_2", "name": "Single-Leg RDL", "video": "https://www.youtube.com/shorts/9JtRH_qZa-w", "isProgrammed": true, "note": "• Square Hips: The biggest mistake is letting the hip of the lifting leg rotate upward. Keep both hip bones pointing at the floor like headlights.\n• Soft Knee: The standing leg should not be locked straight; keep a micro-bend in the knee for balance.\n• The Teeter-Totter: Your torso and back leg should move as one unit. If your chest drops, your leg goes up.", "sets": [{ "id": 204, "weight": 0, "reps": 8, "completed": false }, { "id": 205, "weight": 0, "reps": 8, "completed": false }] },
        { "id": "p2a_3", "name": "Copenhagen Plank (Motion)", "video": "https://www.youtube.com/shorts/5paDavNMjGM", "isProgrammed": true, "note": "• The Movement: Unlike the hold in Phase 1, you now lower your bottom hip toward the floor (controlled) and drive it back up to the starting plank position.\n• Range of Motion: Only go as low as you can without pain or twisting.\n• Adductor Focus: The drive upward should come from the top inner thigh pressing down into the bench.", "sets": [{ "id": 206, "reps": 8, "completed": false }, { "id": 207, "reps": 8, "completed": false }] },
        { "id": "p2a_4", "name": "Box / Squat Jumps", "video": "https://www.youtube.com/shorts/Z9Vw6MxOHP8", "isProgrammed": true, "note": "• The Landing: The landing is more important than the jump. Land quietly with knees bent and hips back. If you land with a loud \"thud,\" you are jarring your joints.\n• Step Down: Jump up, but step down. Do not jump off the box backwards; this risks an Achilles injury.\n• Arm swing: Use your arms to generate momentum. Swing them back as you load, and throw them up as you jump.", "sets": [{ "id": 208, "reps": 5, "completed": false }, { "id": 209, "reps": 5, "completed": false }] },
        { "id": "p2a_5", "name": "Swiss Ball Plank", "video": "https://youtube.com/shorts/DMmHS_O3NCU?si=FOm4BGWEaa56pob5", "isProgrammed": true, "note": "• Instability: Place your elbows on the Swiss ball and feet on the floor. The ball will shake; your job is to stop it.\n• Shoulder Position: Push your elbows into the ball to separate your shoulder blades (protraction). Do not sink into your shoulders.\n• Anti-Extension: Don't let your lower back sag. Tuck your tailbone slightly to keep the core engaged.", "sets": [{ "id": 210, "weight": 20, "reps": 1, "completed": false }, { "id": 211, "weight": 20, "reps": 1, "completed": false }] },
        { "id": "p2a_6", "name": "Bent-Over Reverse Fly", "video": "https://youtu.be/84XhJDxRf10?si=f4NjFsg-IcQHfUW8", "isProgrammed": true, "note": "• Torso Angle: Hinge forward until your torso is nearly parallel to the floor. Keep your back flat.\n• The Squeeze: Lift the weights out to the side. Imagine trying to pinch a pencil between your shoulder blades at the top.\n• Control: Lower the weights slowly. Don't let gravity do the work.", "sets": [{ "id": 212, "weight": 0, "reps": 12, "completed": false }] }
      ]
    },
    {
      "id": "p2_b",
      "title": "Phase 2: Workout B (Weeks 5-8)",
      "sub": "Peak Stability & Core",
      "color": "bg-blue-500",
      "gradient": "from-blue-500 to-cyan-400",
      "icon": "push",
      "exercises": [
        { "id": "p2b_1", "name": "Barbell Deadlift", "video": "https://www.youtube.com/watch?v=r4MzxtBKyNE", "isProgrammed": true, "note": "• Slack: Before you lift, pull up slightly on the bar until you hear the \"clink\" of the weights against the collars. This engages your body before the heavy pull.\n• Leg Drive: The first part of the movement is a leg press. Push the floor away with your feet.\n• Lockout: Stand tall at the top. Squeeze your glutes to finish the lift—don't lean back and hyperextend your spine.", "sets": [{ "id": 221, "weight": 0, "reps": 6, "completed": false }, { "id": 222, "weight": 0, "reps": 6, "completed": false }, { "id": 223, "weight": 0, "reps": 6, "completed": false }] },
        { "id": "p2b_2", "name": "Bulgarian Split Squat", "video": "https://youtube.com/shorts/Q20qIs79tJc?si=JFTdgfIRlQ_d_oSV", "isProgrammed": true, "note": "• Setup: Sit on the bench, extend one leg straight out, and stand up. That is usually the perfect distance for your front foot.\n• Torso Angle: Keep your torso upright to bias the hip flexor stretch and quad strength. Lean forward slightly if you want more glute.\n• Grind: This is uncomfortable. Focus on slow, controlled reps. Do not bounce out of the bottom.", "sets": [{ "id": 224, "weight": 0, "reps": 8, "completed": false }, { "id": 225, "weight": 0, "reps": 8, "completed": false }] },
        { "id": "p2b_3", "name": "Skater Hops (Lateral Bound)", "video": "https://youtube.com/shorts/ZkYORFHgRTw?si=9D1Y7XXGCRq6p74Z", "isProgrammed": true, "note": "• Lateral Power: Push off the outside edge of your jumping foot. You are trying to cover distance sideways, not height.\n• The Stick: Land on one leg and freeze for 1 second before jumping back. This \"stick\" trains stability for sudden changes of direction.\n• Back Leg: The non-landing leg can swing behind you for balance, but try not to let the foot touch the ground.", "sets": [{ "id": 226, "reps": 6, "completed": false }, { "id": 227, "reps": 6, "completed": false }] },
        { "id": "p2b_4", "name": "Copenhagen Plank (Adv. Hold)", "video": "https://www.youtube.com/shorts/5paDavNMjGM", "isProgrammed": true, "note": "• Progression: The top leg is now completely straight, with the ankle/foot resting on the bench. This increases the lever arm, making it significantly harder on the adductors.\n• Alignment: Draw a straight line from your ear to your ankle.\n• Breathing: Take shallow breaths into your ribs while keeping your abs tight (braced). Don't let your belly relax.", "sets": [{ "id": 228, "weight": 30, "reps": 1, "completed": false }, { "id": 229, "weight": 30, "reps": 1, "completed": false }] },
        { "id": "p2b_5", "name": "Pallof Press", "video": "https://youtube.com/shorts/5aZ0IhJS8O8?si=MiUdydKvRlsBP4H5", "isProgrammed": true, "note": "• Setup: Stand perpendicular to a cable machine or resistance band. Hold the handle at your chest.\n• The Press: Press the handle straight out in front of you. The weight will try to twist your body toward the machine—don't let it.\n• Core: The further your hands are from your body, the harder your core has to work. Hold for 1-2 seconds at full extension.", "sets": [{ "id": 230, "weight": 0, "reps": 10, "completed": false }, { "id": 231, "weight": 0, "reps": 10, "completed": false }] },
        { "id": "p2b_6", "name": "Seated Cable Row", "video": "https://youtube.com/shorts/qD1WZ5pSuvk?si=FFztjEXpKs8MkweX", "isProgrammed": true, "note": "• Full Stretch: Let your shoulders roll forward slightly at the start to stretch the lats.\n• The Pull: Initiate the pull by retracting your shoulder blades, then driving your elbows back past your ribs.\n• No Momentum: Don't rock back and forth to move the weight. Keep your torso stationary.", "sets": [{ "id": 232, "weight": 0, "reps": 8, "completed": false }, { "id": 233, "weight": 0, "reps": 8, "completed": false }] },
        { "id": "p2b_7", "name": "DB Bench Press", "video": "https://youtube.com/shorts/WbCEvFA0NJs?si=jWQefHypbOQr6lfq", "isProgrammed": true, "note": "• 45-Degree Angle: Don't flare your elbows out to 90 degrees (T-shape). Tuck them slightly (arrow shape) to protect your shoulders.\n• Stability: Plant your feet firmly on the floor. They are your anchor.\n• Dumbbells: Unlike a barbell, you have to stabilize each hand independently. If one hand lags, that is your weaker side—focus on keeping them even.", "sets": [{ "id": 234, "weight": 0, "reps": 8, "completed": false }, { "id": 235, "weight": 0, "reps": 8, "completed": false }] }
      ]
    },
    {
      "id": "p3_a",
      "title": "Phase 3: Workout A (Weeks 9-12)",
      "sub": "Power & Specificity",
      "color": "bg-red-600",
      "gradient": "from-red-600 to-rose-500",
      "icon": "functional",
      "exercises": [
        { "id": "p3a_1", "name": "Split Squat Jumps", "video": "https://youtube.com/shorts/sR1tV08BZBo?si=1I3bW5I3iV2Iadi4", "isProgrammed": true, "note": "• The Scissor: Start in a lunge position. Jump up explosively, switch your legs in mid-air (scissor motion), and land with the opposite leg forward.\n• Cushion the Landing: Do not land with a stiff leg. Absorb the impact immediately by sinking into the next lunge. If you hear a loud \"thump,\" you are landing too hard.\n• Torso Control: Keep your chest up. If your chest collapses forward upon landing, you are losing core stability—a critical error to avoid when landing a horse off a fence.", "sets": [{ "id": 301, "weight": 0, "reps": 5, "completed": false }, { "id": 302, "weight": 0, "reps": 5, "completed": false }] },
        { "id": "p3a_2", "name": "KB Swings", "video": "https://youtube.com/shorts/2gXtvqLa_T8?si=HNoAWFba68wa8SlA", "isProgrammed": true, "note": "• It’s a Hinge, Not a Squat: Your knees should bend only slightly. The movement comes from pushing your hips back, then snapping them forward.\n• The Float: Your arms are just ropes connecting your body to the bell. Do not lift the weight with your shoulders. The bell should float up due to the power of your hip drive.\n• Top Position: At the top of the swing, you should be standing in a tall, rigid plank. Squeeze your glutes and abs hard. Don't lean back (hyperextend).", "sets": [{ "id": 303, "weight": 0, "reps": 10, "completed": false }, { "id": 304, "weight": 0, "reps": 10, "completed": false }] },
        { "id": "p3a_3", "name": "Depth Drops to Jump", "video": "https://youtube.com/shorts/gpXV2dzZ-oA?si=8mE5Zsuhn7AZa2Tp", "isProgrammed": true, "note": "• Gravity does the work: Step off the box (don't jump off). Let gravity take you down.\n• Reactive Power: The moment your feet touch the ground, explode straight up into a vertical jump. Imagine the floor is made of hot coals—get off it as fast as possible.\n• Knees: Ensure your knees don't cave inward (valgus) when you hit the ground. Keep them tracking over your toes.", "sets": [{ "id": 305, "reps": 5, "completed": false }, { "id": 306, "reps": 5, "completed": false }] },
        { "id": "p3a_4", "name": "Copenhagen (Maintenance)", "video": "https://www.youtube.com/shorts/5paDavNMjGM", "isProgrammed": true, "note": "• Maintenance Mode: By Phase 3, you should have significant adductor strength. This set is about holding that strength without blowing out the muscles before a ride.\n• Position: Top ankle on the bench, bottom leg lifted. Hold for the programmed time with perfect alignment.\n• Regulate: If the \"Adv. Hold\" from Phase 2 feels too heavy today, regress to the knee placement. The goal here is activation, not failure.", "sets": [{ "id": 307, "weight": 45, "reps": 1, "completed": false }] },
        { "id": "p3a_5", "name": "Turkish Get-Up", "video": "https://youtu.be/sgd8n917Zv0?si=TFf0l17uL9jCTFv5", "isProgrammed": true, "note": "• Eye Contact: Keep your eyes locked on the kettlebell/dumbbell the entire time until you are standing fully upright. This improves balance.\n• The Steps: Roll to elbow → Push to hand → Bridge hips up → Sweep leg under to a kneeling position → Windmill the torso up (straighten out) → Stand up.\n• Shoulder Packing: Keep your shoulder \"packed\" down and back. Don't let the weight shrug up toward your ear.", "sets": [{ "id": 308, "weight": 0, "reps": 3, "completed": false }, { "id": 309, "weight": 0, "reps": 3, "completed": false }] },
        { "id": "p3a_6", "name": "Farmers Carry", "video": "https://youtube.com/shorts/1uOs1hP3u4A?si=5lK18z2xPzFXfAB1", "isProgrammed": true, "note": "• Posture: Imagine a string pulling the top of your head to the sky. Do not slouch.\n• Rib Cage: Keep your ribs tucked down. A common mistake is flaring the ribs to compensate for the heavy weight.\n• Gait: Walk with short, choppy, controlled steps. Do not waddle side-to-side. The weights should hang slightly away from your thighs so they don't bounce off your legs.", "sets": [{ "id": 310, "weight": 30, "reps": 1, "completed": false }, { "id": 311, "weight": 30, "reps": 1, "completed": false }] },
        { "id": "p3a_7", "name": "Swiss Ball Plank", "video": "https://youtube.com/shorts/DMmHS_O3NCU?si=FOm4BGWEaa56pob5", "isProgrammed": true, "note": "• Stir the Pot (Optional Progression): If the standard hold is too easy in Phase 3, you can gently make small circles with your elbows (\"stirring the pot\") to increase the instability.\n• Glute Lock: Squeeze your glutes hard. This stabilizes the pelvis and prevents the lower back from taking over the load.\n• Neck: Keep your neck neutral—look at your hands, not your feet or the wall.", "sets": [{ "id": 312, "weight": 30, "reps": 1, "completed": false }, { "id": 313, "weight": 30, "reps": 1, "completed": false }] },
        { "id": "p3a_8", "name": "Goblet Squat Half Hold", "video": "https://youtube.com/shorts/yMpTN3R3Uu0?si=1O2AvPDY1qRfbNIA", "isProgrammed": true, "note": "• The Position: Lower into a squat and stop exactly halfway up (thighs parallel to the floor). Hold there.\n• The Burn: This isometric hold is designed to create rapid fatigue and heart rate spikes.\n• Mental Focus: Do not let your chest collapse as you get tired. Fight to keep your elbows off your knees and your torso vertical.", "sets": [{ "id": 314, "weight": 30, "reps": 1, "completed": false }, { "id": 315, "weight": 30, "reps": 1, "completed": false }] }
      ]
    }
  ]
}